app/Controllers/AdminAuth.php

SELECT *
FROM `regime_admins`
WHERE `email` = 'admin@regime.local'
 LIMIT 1
---
    public function authenticate()
    {
        $rules = [
            'email' => 'required|valid_email',
            'password' => 'required',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $admins = new RegimeAdminModel();
        $email = strtolower(trim((string) $this->request->getPost('email')));
        $admin = $admins->where('email', $email)->first();