app/Controllers/Auth.php

SELECT *
FROM `regime_utilisateurs`
WHERE `email` = 'mariah@exemple.com'
 LIMIT 1
---
    public function storeRegisterStepOne()
    {
        $rules = [
            'nom' => 'required|min_length[2]|max_length[100]',
            'email' => 'required|valid_email|max_length[100]',
            'password' => 'required|min_length[8]|max_length[255]',
            'genre' => 'required|in_list[femme,homme]',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $utilisateurs = new RegimeUtilisateurModel();
        $email = strtolower(trim((string) $this->request->getPost('email')));

        if ($utilisateurs->where('email', $email)->first() !== null) {

INSERT INTO `regime_utilisateurs` (`nom`, `email`, `password`, `genre`, `is_gold`) VALUES ('Mariah RAVELOMANANA', 'mariah@exemple.com', '$2y$12$rquzDirKnKad.amCylHDe.4xObIaOhD2N7rjxnXj5Ppl9TO6h//Kq', 'femme', 0)
---
    public function storeRegisterStepTwo()
    {
        $stepOne = session('registration_step1');

        if ($stepOne === null) {
            return redirect()->to('/inscription')->with('errors', [
                'inscription' => 'Complete d abord la premiere etape.',
            ]);
        }

        $rules = [
            'taille' => 'required|greater_than_equal_to[80]|less_than_equal_to[240]',
            'poids' => 'required|greater_than_equal_to[20]|less_than_equal_to[300]',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $taille = (float) $this->request->getPost('taille');
        $poids = (float) $this->request->getPost('poids');
        $tailleMetres = $taille / 100;
        $imc = $tailleMetres > 0 ? round($poids / ($tailleMetres * $tailleMetres), 2) : 0;

        $db = db_connect();
        $utilisateurs = new RegimeUtilisateurModel();
        $sante = new RegimeSanteModel();

        $db->transStart();

        $userId = $utilisateurs->insert([
            'nom' => $stepOne['nom'],
            'email' => $stepOne['email'],
            'password' => $stepOne['password'],
            'genre' => $stepOne['genre'],
            'is_gold' => 0,
        ], true);

SELECT *
FROM `regime_utilisateurs`
WHERE `email` = 'jean@gmail.com'
 LIMIT 1
---
    public function authenticate()
    {
        $rules = [
            'email' => 'required|valid_email',
            'password' => 'required',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $utilisateurs = new RegimeUtilisateurModel();
        $email = strtolower(trim((string) $this->request->getPost('email')));
        $user = $utilisateurs->where('email', $email)->first();