app/Controllers/Produit.php

SELECT *
FROM `produits`
ORDER BY `nom` ASC
---
    public function index(): string
    {
        $model = new ProduitModel();

        $data = [
            'produits' => $model->orderBy('nom', 'ASC')->findAll(),
        ];