app/Controllers/Profil.php

    public function index()
    {
        if (! session('is_logged_in')) {
            return redirect()->to('/login')->with('errors', [
                'auth' => 'Connecte-toi pour acceder a ton profil.',
            ]);
        }

        $userId = (int) session('user_id');

        if ($userId <= 0) {
            return redirect()->to('/login')->with('errors', [
                'auth' => 'Session invalide. Merci de te reconnecter.',
            ]);
        }

        $utilisateurs = new RegimeUtilisateurModel();
        $santeModel = new RegimeSanteModel();

        $user = $utilisateurs->find($userId);
        $sante = $santeModel->where('user_id', $userId)->first();
---
SELECT *
FROM `regime_utilisateurs`
WHERE `regime_utilisateurs`.`id` = 11
SELECT *
FROM `regime_sante`
WHERE `user_id` = 11
 LIMIT 1